from utils import important_message

def main() -> None:
    """
    функция запрашивает у пользователя сообщение и выводит его с помощью функции important_message из utils
    """
    message = input("текст сообщения: ")
    framed_message = important_message(message)
    print(f"\n{framed_message}\n")

# python3 -i 2.py
# >>> main()
# текст сообщения: ЗАГОЛОВОК ПРОГРАММЫ
#
# #=============================================================================#
# #                                                                             #
# #                              ЗАГОЛОВОК ПРОГРАММЫ                            #
# #                                                                             #
# #=============================================================================#
#
# >>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
# >>> msg = important_message(text)
# >>> print(msg)
# #=============================================================================#
# #                                                                             #
# #     Обратите внимание на очень важное сообщение от команды разработчиков    #
# #                         этой великолепной программы                         #
# #                                                                             #
# #=============================================================================#
# >>>
